In [1]:
%load_ext sql

In [2]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

'Connected: student@sparkifydb'

In [3]:
#return all data in songplay table
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(1, datetime.datetime(2018, 11, 29, 0, 0, 57, 796000), '73', 'paid', 'SOINLJW12A8C13314C', 'AR8IEZO1187B99055E', 954, 'Tampa-St. Petersburg-Clearwater, FL', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"'),
 (2, datetime.datetime(2018, 11, 29, 0, 1, 30, 796000), '24', 'paid', 'SOINLJW12A8C13314C', 'AR8IEZO1187B99055E', 984, 'Lake Havasu City-Kingman, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"'),
 (3, datetime.datetime(2018, 11, 29, 0, 4, 1, 796000), '24', 'paid', 'SOINLJW12A8C13314C', 'AR8IEZO1187B99055E', 984, 'Lake Havasu City-Kingman, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"'),
 (4, datetime.datetime(2018, 11, 29, 0, 4, 55, 796000), '73', 'paid', 'SOINLJW12A8C13314C', 'AR8IEZO1187B99055E', 954, 'Tampa-St. Petersburg-Clearwater, FL', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"'),
 (5, datetime.datetime(2018, 11, 29, 0, 7, 13, 796000), '24', 'paid', 'SOINLJW12A8C13314C', 'AR8IEZO1187B99055E', 984, 'Lake Havasu City-Kingman, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"')]

In [4]:
#return all data in user table
%sql SELECT * FROM users LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('73', 'Jacob', 'Klein', 'M', 'paid', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"'),
 ('24', 'Layla', 'Griffin', 'F', 'paid', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"'),
 ('50', 'Ava', 'Robinson', 'F', 'free', '"Mozilla/5.0 (Windows NT 6.3; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 ('54', 'Kaleb', 'Cook', 'M', 'free', 'Mozilla/5.0 (Windows NT 6.1; WOW64; rv:31.0) Gecko/20100101 Firefox/31.0'),
 ('32', 'Lily', 'Burns', 'F', 'free', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"')]

In [5]:
#return all data in songs table
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('SOINLJW12A8C13314C', 'City Slickers', 'AR8IEZO1187B99055E', 2008, 150),
 ('SOGDBUF12A8C140FAA', 'Intro', 'AR558FS1187FB45658', 2003, 76),
 ('SORRZGD12A6310DBC3', 'Harajuku Girls', 'ARVBRGZ1187FB4675A', 2004, 291),
 ('SONWXQJ12A8C134D94', 'The Ballad Of Sleeping Beauty', 'ARNF6401187FB57032', 1994, 305),
 ('SOFCHDR12AB01866EF', 'Living Hell', 'AREVWGE1187B9B890A', 0, 282)]

In [6]:
#return all data in songplay table
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('AR8IEZO1187B99055E', 'Marc Shaiman', '', nan, nan),
 ('AR558FS1187FB45658', '40 Grit', '', nan, nan),
 ('ARVBRGZ1187FB4675A', 'Gwen Stefani', '', nan, nan),
 ('ARNF6401187FB57032', 'Sophie B. Hawkins', 'New York, NY [Manhattan]', -73.9664, -73.9664),
 ('AREVWGE1187B9B890A', 'Bitter End', 'Noci (BA)', -41.9952, -41.9952)]

In [7]:
#return all data in time table
%sql SELECT * FROM time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(datetime.datetime(2018, 11, 29, 0, 0, 57, 796000), 0, 29, 48, 11, 2018, 3, 954),
 (datetime.datetime(2018, 11, 27, 0, 52, 12, 796000), 0, 27, 48, 11, 2018, 1, 961),
 (datetime.datetime(2018, 11, 11, 2, 33, 56, 796000), 2, 11, 45, 11, 2018, 6, 455),
 (datetime.datetime(2018, 11, 18, 2, 33, 21, 796000), 2, 18, 46, 11, 2018, 6, 693),
 (datetime.datetime(2018, 11, 8, 1, 11, 50, 796000), 1, 8, 45, 11, 2018, 3, 19)]

In [23]:
#top 10 most listen to songs
qry = """SELECT A.artist_name,SUM(s.duration)/60 as minutes_listen,s.title
FROM songs s
JOIN artists A on A.artist_id = s.artist_id
GROUP BY artist_name, title
ORDER BY 2 DESC
LIMIT 10"""

%sql $qry

 * postgresql://student:***@127.0.0.1/sparkifydb
10 rows affected.

[('Faiz Ali Faiz', 9, 'Sohna Nee Sohna Data'),
 ('Montserrat Caballé;Placido Domingo;Vicente Sardinero;Judith Blegen;Sherrill Milnes;Georg Solti', 8, 'Sono andati? Fingevo di dormire'),
 ('Blue Rodeo', 8, 'Floating'),
 ('John Wesley', 8, 'The Emperor Falls'),
 ('Trafik', 7, 'Salt In NYC'),
 ('Jinx', 6, 'Kutt Free (DJ Volume Remix)'),
 ('Steve Morse', 6, 'Prognosis'),
 ('Lionel Richie', 5, 'Tonight Will Be Alright'),
 ('King Curtis', 5, 'A Whiter Shade Of Pale (Live @ Fillmore West)'),
 ('Luna Orbit Project', 5, 'Midnight Star')]

In [25]:
#number of female and male signed up and their status
qry = """select gender ,level as status,count(*) as no_of_users from users 
Group by 1,2
ORDER BY 1"""
%sql $qry

 * postgresql://student:***@127.0.0.1/sparkifydb
4 rows affected.

[('F', 'free', 40), ('M', 'free', 34), ('M', 'paid', 7), ('F', 'paid', 15)]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).